#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2018/7/9 10:30
# @Author  : Kaiwen Xue
# @File    : cases_processing.py
# @Software: PyCharm
import csv
import re
import linecache
from random import randint

# STEP 1
# new_kg = open('/Users/Kevin/Downloads/1824_result.txt')
# kg = open('/Users/Kevin/Downloads/kg_cases_1824.txt')
# same = open('/Users/Kevin/Downloads/same.txt', 'w')
# dif = open('/Users/Kevin/Downloads/dif.txt', 'w')
#
# same_count = 0
# dif_count = 0
#
# for i in range(1,1801):
#
#     ls = linecache.getline('/Users/Kevin/Downloads/1824_result.txt', i)
#     lines = linecache.getline('/Users/Kevin/Downloads/kg_cases_1824.txt', i)
#
#     a = lines.split('|')
#     b = a[1].split('\t')
#     del (b[1])
#     b[1] = b[1].strip()
#     b[1] = re.sub(r', "sign": ".*?"', '', b[1])
#     b[1] = re.sub(r'"option": .*?,','',b[1])
#     c ='\t'.join(b)
#
#     ls = ls.strip()
#     ls_t = re.sub(r', "sign": ".*?"', '', ls)
#     ls_t = re.sub(r'"option": .*?,','',ls_t)
#
#     if c == ls_t:
#         same.writelines(b[0]+'\n')
#         same_count += 1
#
#     else:
#         dif.writelines(ls+'\n')
#         dif_count += 1
#
# print(same_count, dif_count, same_count+dif_count)

# STEP 2
# badcase = open('/Users/Kevin/Downloads/kg_badcase_167.txt')
# wrong = open('/Users/Kevin/Downloads/kg_series-version_wrong_83.txt')
# lost = open('/Users/Kevin/Downloads/kg_serires-version_lost_193.txt')
#
# same = ['铃木650sv', '铃木re5二手', '铃木口琴c20优缺点', '铃木天语sx4汽车配件', '铃木英祖玛400', '银色哈弗h6运动版', '锋范发动机舱隔热铝板', '锋范点火锁芯拆装步骤', '锐志全车配件', '锐志广告词', '锐志空调按键图解', '锐界小保', '锐界行驶途中突然不会制冷', '锤子坚果3防水吗', '锤子坚果pro2续航怎么样', '锦星一汽-大众4S店怎么样', '长城7号', '长城c70什么时候上市', '长城m2改天窗', '长城p8的电池是自己的吗', '长城vv7s首付价格', '长城原创', '长城汽车空调怎么开', '长城特制解百纳', '长城瑰密', '长城风骏5柴油皮卡保养灯怎么归零', '长城高级解百纳干红750ml', '长安2018款逸动改车灯', '长安CS55三保多少钱', '长安cs35中控显示屏价格', '长安cs55手动挡怎么样', '长安cx7016标准型怎么样', '长安sl5', '长安v802价格', '长安之星2代中门异响', '长安之星6363空调安装', '长安之星节气门组成部件', '长安凌轩油表灯亮后还能跑多少公里', '长安奔奔ev充电电压', '长安小型集装箱货车', '长安悦翔abs', '长安悦翔后雾灯老是坏是什么意思', '长安新豹保修多久', '长安星卡座套货到付款', '长安星豹单排小货车铭牌在哪', '长安欧尚七坐新车发动机怎么看的旧旧的正常吗', '长安欧尚下臂', '长安汽哪产的', '长安汽车6.5万面包车加长版', '长安汽车加长版面包车', '长安灵沼要归高新了吗', '长安睿骋排气管改装', '长安福特锐界底板安装', '长安车身车身模块怎么获取安全代码', '长安逸动倒车镜怎么拆', '长安逸动车钥匙怎么拔不出来', '长安铃木北斗星汽车', '长安面包水泵怎么拆', '长沙10-12万公里二手明锐', '长虹32e8怎么样', '长虹3d46c2000i换内屏多钱', '长虹50f9电视日期', '长虹电视43寸4k多少钱', '闲聊Jeep新指南者到底好不好?', '阳光保险车意纪念基础版五座保费什么意思', '阳光的雨刷喷水开关在哪', '阻止三星主题商店的更新', '阿特兹2.0有运动版', '阿特兹一下解锁', '阿特兹后期做隔音需要多少钱', '阿特兹投诉', '阿赛尔秦', '陆虎发现轮胎', '陆风C8', '陆风程亦辰第一次肉', '陈震试驾2018款凯美瑞', '随机联想法', '雄狮红盒', '雅阁 思铂睿', '雅阁减震有沙子有什么影响', '雅阁怎么分几代', '雅阁电子驻车怎么关', '雨燕关了离合三件套后离合特青', '雨燕时尚型酷玩版 2018', '雨燕正时涨紧器弹簧怎么安装', '雪佛兰可以改标吗', '雪佛兰探界音响配置', '雪佛兰沃蓝达', '雪佛兰科罗拉多皮卡', '雪佛兰科迈罗大黄蜂二手', '雪佛兰科鲁兹点烟器', '雪弗兰 锁的警示标志', '雪弗兰科鲁兹1八款保养归零', '雪弗兰赛欧自动档怎么启动', '雪福来爱唯欧怎么样', '雪铁龙c2发电机位置', '雪铁龙c5钥匙换电池', '雪铁龙世嘉车轮胎上有油是怎么回事', '零9年伊兰特多钱', '雷克萨斯LⅩ570', '雷克萨斯es最新上市多少钱', '雷克萨斯es首付', '雷克萨斯rx270保养贵?', '雷克萨斯官网中国', '雷凌仪表盘小棍作用', '雷凌加尾翼', '雷凌双擎精英天窗版定速巡航', '雷斯特w换了减振弹簧', '雷诺科雷傲倒车镜', '雷诺科雷嘉后保险杠', '霍顿跑车贵吗', '青岛东风二手车', '青岛胶州汉兰达有4S店吗', '非常苹果饮料 童年', '面包货车运营证要钱吗', '领克01几座', '领克无限', '领动1.6l自炫豪华型', '风云2空调滤芯在哪里 m.020h.com', '风行s500什么时候出国6', '风骏5后保险杠多少钱', '飞利浦 x800', '飞利浦she3205耳机好吗', '飞度858和738', '飞度水箱电', '飞度运货', '飞驰 V8 平行进口', '首付三万能买什么suv', '香港地区奥迪轻微追尾事故图片', '马拉沙蒂总裁报价', '马自达 mps 无敌汽车网', '马自达2两厢油耗多少', '马自达6的汽油格', '马自达aexla3', '马自达cx7最低报价', '马自达dvd导航电源图', '马自达mx5国内试驾视频', '马自达昂克赛拉有中置拉叭', '马自达昂克赛拉格调灰', '马自达是哪个国家原产', '马自达泵头批发', '马自达补两道漆多少钱', '马里奥奥德赛倒金字塔', '骐达报警器怎么拆', '骐达换什么轮胎好', '高尔夫,', '高尔夫1.4l dct', '高尔夫1.6加装涡轮', '高尔夫7代12档顿挫', '高尔夫7玻璃水箱容量', '高尔夫gti加什么机油', '高尔夫rline仪表盘', '高尔夫电动汽车 国产', '高尔夫百万辆纪念版车型大灯灯泡和那个版本是一样的', '高尔夫耗油怎么样', '高通660的芯片相当于苹果的什么水平', '高通骁龙660和麒麟950', '魅族 来电 不响音乐', '魅族 锁定区文件消失', '魅族3手机介绍', '魅族Mx6垃圾', '魅族ep21耳机 接线', '魅族flyme原始密码是多少', '魅族m3 note截屏在那', '魅族mx3的耳机', '魅族mx5照相模糊', '魅族no?to?5充电发热', '魅族note5用哪个导航', '魅族x460', '魅族做吧', '魅族官方售后', '魅族官网flyme登陆', '魅族怎么改接电话方式', '魅族怎样更新系统版本', '魅族手机为什么截图没显示', '魅族手机发语音没声音', '魅族手机怎么消除按键声音', '魅族手机换个充电接口', '魅族手机音量键失灵怎么办', '魅族更新系统后很耗电', '魅族游戏评测', '魅族耳机EP21如何', '魅族降温神器', '魅族魅蓝5开不开机怎么刷机软件下载', '魅蓝s6参数华为荣耀9参数', '魔声耳机和苹果耳机', '麒麟659和高通820', '黄冈华为万达体验店', '黄岩翔远别克4s店电话', '黄海h5', '黄龙会出跑车款吗', '黑色手机卡', '黑里程', '黑鲨手机费电', '龙岩吉利汽车', '龙泉驿区三星冰箱售后维修服务', ',14年,宝马英里改成公里', '0.8乐驰保险盒示意图', '03年奥迪a43.0叫b', '04年宝来正时是皮带还是链条', '04年日产天懒值多少钱', '05年雷克萨斯rx300优缺点', '06年别克凯悦怎么样', '07年伊兰特值多少钱', '07皇冠3.0空调不凉', '08年宝马320i动力可以吗', '08年途安凸轮轴位置传感器在哪里效果图', '08老款长安奔奔内饰', '08马自达3方向盘沉', '09年天籁公爵水箱价格多少钱?', '09款奥迪a4', '09款福瑞迪', '09科鲁兹和12科鲁兹风挡玻璃一样么', '1.4t奥迪a3多大马力', '1.6高尔夫换2.0t总成', '1.8t高配迈腾', '100万贷款分10年还', '10万b型房车', '10万元车一个月费用', '10图广汽', '10款奥迪a4l2.0t油耗', '10自动档车', '11年傲虎2.5正时安装图', '11年风云2卖多钱', '12-14万SUV', '12年东风嘉龙4米5自卸车六缸180马力', '12年科鲁兹是什么变速箱', '12新福克斯 后面有李子串吗', '12款铃木雨燕自动挡', '13款别克英朗行驶时出现抖动', '13款马自达6倒车镜壳怎么拆', '14年的宝马黑车子刮花了,自己刮的', '15万左右的suv排行榜', '16年路虎揽胜抱底盘控制模块码', '17年福特翼博右镜总成4s店換几钱', '17新科鲁兹倒后镜', '17款丰田FJ酷路泽在哪里好', '17款奥迪a6l发动机型号', '17款科雷傲多少公里保养一次', '17款空调滤清器斯柯达明锐视频', '17款轩逸导航拆装图解', '18年新迈腾一万公里', '18款丰田红杉哪儿有', '18款挑战者300价格', '18款维特拉', '18款迈锐宝后排座椅锁不上可以放倒', '2.4八代雅阁台速高', '2.5天籁cvt变速箱油更换', '2000年有20万', '2007年首台荣威750下线时间', '2007斯柯达明锐1.8t加多少号油', '2007款奥迪a42.0t', '2008款日产骊威', '2009款大众朗逸脚垫2.0', '2010款捷达的车辆轴距是多少', '2010款骐达', '2011年奇骏配置', '2011款雨燕是国几排放的呀', '2012宝来发动机舱底部图解', '2012款君越钥匙什么样', '2013小米3开不了机怎么办', '2014东风日产阳光风机在什么位置', '2014款君威豪华版参数配置', '2015 年 途观 发动机护板', '2015年现代途胜多少钱', '2015款三菱劲炫怎么样', '2016奥迪a3仪表盘上的公里数能不能隐藏掉', '2016年北京购房新政', '2017北京女排名单', '2017年爱丽舍邮箱容积', '2017斗鱼嘉年华时间', '2017朗逸1.6豪华版', '2017款昂科威最新视频', '2017款朗逸天窗怎么开启', '2017速腾日行等怎么关掉', '2017锋范舒适版的缺点', '2018mustang', '2018三菱欧蓝德轮胎改装', '2018乐视全面屏手机', '2018北京博览会', '2018大众捷达时尚型', '2018小米六还值得买吗', '2018小米第一季度营收', '2018帝豪车载导航自动更新吗', '2018年4月份索纳塔九销量', '2018年六坐丰田汉兰达多少钱', '2018年江铃E200报价', '2018新奔驰c级', '2018最新款五菱宏光s3视频播放', '2018款1.4T速腾刷隐藏', '2018款七座车价格及图片', '2018款大众途行', '2018款奥迪a4牛逼', '2018款斯柯达速派钥匙', '2018款玛莎拉蒂总裁530gts', '2018款途乐防撞钢梁图', '2018款马自达6试车视频', '2018瑞虎3评价', '2018福睿斯自动挡都有什么版本的汽车', '2018路虎皇家一号', '2018速腾1.4华南区定制版视频', '2018速腾油箱多大', '2018长安欧尚a600报价', '2019款博越', '206改涡轮增压', '20万左右的油电两用车', '23万的车分期', '24 105索尼', '2一3万微型小汽车', '2图10年3.3米江淮好运0.95万', '30-50万德系中型SUV操控排行榜新鲜出炉,宝马X3', '30万的车保险多少钱', '360手机内存32G运行4g', '360手机触屏没反应', '39坐客车长度', '3m晶锐和铂睿', '4.8米货车可以上蓝牌吗', '4g手机没有4g网络咋办', '4米2货车那个牌子好', '5x为啥没有国际版miui', '5系宝马链接蓝牙怎么放歌', '600p庆铃双排货车', '6月2央视2苹果报道', '70-80万的车有哪款', '740li宝马解介', '7万买什么轿车', '7座suv哪款车较好', '7座东风小康多少钱', '8848 风尚版和巅峰版区别', '8一9万二手轮式装蔗机', '9座威霆高速怎么收费', 'Americapic', 'Apple Watch苹果标志闪烁', 'Boxster S', 'Diego一AL00C00B201是华为什么型', 'G85学习大众', 'HTCG6怎么样', 'Htc手机红绿蓝黑白5色图 全屏看', 'LG G5参数', 'LG的意思', 'MINI车怎么样', 'OPPO v57', 'OPPOR7PLUS能用英国卡吗', 'OPPOfindx和1加6', 'OPPOr11plus距离感应器', 'OPPOr15屏幕多大尺寸', 'OPPOr9plus代码格式化', 'OPPO不能发信息', 'OPPO如何查看是全网通手机', 'OPPO手机为什么不能截屏', 'OPPO电量百分百', 'OPPO视频实测', 'Oppoa3手机怎么样', 'Oppor11 怎么截屏', 'Samsung/三星55MU6320', 'The matrix', 'VIVO怎么注销账户', 'ViVO V 2', 'ViVOX21i亲手机用三充三放吗', 'ZenFone 3 Deluxe尊爵版', 'a1518联通3g', 'alpina b4加速', 'arteon大众', 'atsl刷zzp', 'b593s-850华为', 'blue yeti 多少钱', 'bulletbattle苹果', 'c63s coupe ipe排气中尾段', 'cc大众2018新款', 'clvlc东风本田220图片', 'dnf 帕拉丁 荒古太刀', 'dnf帕拉丁异界套3选择', 'envy13金色', 'e人e本的手写笔有什么用', 'gl马自达-5', 'google小屏手机', 'google服务4.4', 'gs宝马', 'gta脸', 'g高尔夫7改装', 'h6coupe 天窗怎么洗', 'htc eris', 'htcL22信号差', 'htcu11发热', 'hybrid hhd', 'iPhone手机开机苹果颜色', 'iuni n1', 'iuni和金立', 'jeep小越野价格', 'jeep服装玉林玉州区专卖店', 'jeep的夹克', 'jeep自由光2.0版', 'l1m1tedJeeP', 'lg G6 v20深度评测', 'lg gram 和xps15', 'lgg3d859参数', 'lg照片打印机型号对比', 'mCharge,支持高通qc吗', 'mg名爵gs', 'mini cooper countryman s', 'miniclubman2017改装', 'mini墨绿色两门', 'mini软件', 'moji辞书在苹果上需要花钱', 'nfc功能是什么oppo', 'nissan altima美国加什么油', 'o7年奔腾车2,0多少钱?', 'oppo a3是否有闪充', 'oppo a57 截屏', 'oppo r 15价格', 'oppo r15为什么扬声器孔有四个堵住的', 'oppo r9s有fm收音机功能吗?', 'oppo x1开机', 'oppo 手机怎样调节像素', 'oppoA1充电蓝颜色怎么了', 'oppoA3手机怎么找到自动旋转', 'oppoa37如何截图', 'oppoa57手机套', 'oppoa73拍照亮度暗', 'oppofind7数据线', 'oppofind7轻装版系统', 'oppor11PLUS换屏幕多少钱', 'oppor11s 红', 'oppor11到日本用不了4g', 'oppor11编辑文字', 'oppor15卡槽设计', 'oppor15新手机怎样插数据线', 'oppor15星空紫会变色吗', 'oppor15桌面时间', 'oppor15陶瓷黑与幻色粉的区别', 'oppor7sm二手手机多少钱', 'oppor9d多少钱', 'oppor9sk多少寸', 'oppor9s那个屏幕上', 'oppor9手机耳机孔坏了修要多少钱', 'oppo为什么不用835', 'oppo奥特曼暗耀形', 'oppo应用数据备份', 'oppo彩色手机', 'oppo怎么取消主题桌面', 'oppo怎么截屏录视频', 'oppo怎么登vivo的时空召唤账号', 'oppo手机不是双卡了吗然后怎么样可以把那个电信的那个卡的流量给打开', 'oppo手机哪个卡是主卡', 'oppo手机怎么坏', 'oppo手机接电话声音小怎么办', 'oppo手机有些功能闪退怎么办,开始是好的', 'oppo手机浮窗设置方法', 'oppo手机短信没有显示', 'oppo手机短信语音播报', 'oppo手机重启后就不卡了', 'oppo是不是注册账号', 'oppo有手电筒的手机有哪些', 'oppo游戏通知栏', 'oppo系统更新在哪', 'oppo账号怎么换手机号', 'p20 谷歌', 'polo1.6机油加几升', 'polo换什么轮胎最好', 'polo钱包', 'ps4高尔夫', 'q3 途观', 'q5lpk福特探险者', 'qx60英菲尼迪', 's40诺基亚', 's7500三星手机报价', 'sd卡华为', 'sports本田', 'suv新车型多少钱', 'suv柴油版', 'suv非字停车技巧视频', 'tcl n3', 'tcl55寸液晶电视屏幕旁有绿色线', 'tcls900怎么强制恢复原厂', 'uip丰田雷凌', 'v.qq.com/x/cover/suvdws3azg0yhxg/i0639sc6pcp.html', 'vivo X1评测', 'vivo nex预售多少', 'vivo x20拍照如何切换为单反模式', 'vivo x21怎么shenmi', 'vivo x5pro耳机推荐', 'vivo x9i管家的音乐怎么自定义铃声', 'vivo y51a有护眼模式么', 'vivo z1是红外人脸解锁吗', 'vivo 模糊显示', 'vivo21拍照按键', 'vivoX6dp 手机发热', 'vivoX7Plus评测', 'vivov316gb多少钱', 'vivox20plus怎样找备份', 'vivox20算什么手机', 'vivox21 怎么截图', 'vivox21全屏钢化膜顶壳现象', 'vivox21旋转', 'vivox21闪退', 'vivox2~', 'vivox7plus 锁屏', 'vivox7plus论坛', 'vivox9S主页', 'vivox9i照片', 'vivox9plus好用不', 'vivox9plus支持联通卡吗', 'vivox9s换屏幕视频', 'vivox9怎么录音', 'vivox9怎样设置红包来了手机铃声', 'vivoxplay5悬浮窗设置', 'vivoxplay6曲面屏', 'vivoy13il运行内存', 'vivoy27root', 'vivoy66刷机不用电脑', 'vivoy67短信功能不见了', 'vivoy75zhut', 'vivoy75怎样刷机', 'vivoy83和vivo85', 'vivoy937', 'vivo什么手机屏幕大', 'vivo充电变慢', 'vivo刺激战场手柄', 'vivo如何制作铃声', 'vivo待机图', 'vivo怎么关闭极简模式', 'vivo手机shed', 'vivo手机为什么显示无法充电没反应', 'vivo手机为什么设置不了图案密码', 'vivo手机为啥没有微信运动', 'vivo手机主键一直发烫', 'vivo手机卡芯片朝上还是朝下', 'vivo手机呼吸灯怎么关', 'vivo手机应用商店xia', 'vivo手机店几点下班', 'vivo手机怎么做长图', 'vivo手机怎么安装车联网', 'vivo手机怎么样删掉头条滚动新建闻', 'vivo手机打电话断网', 'vivo手机无法删除照片', 'vivo手机玩华为游戏怎么充值', 'vivo手机用油量怎么打开火山视频', 'vivo手机能使电信卡不能', 'vivo手机铃声怎么设置', 'vivo手机防盗追踪', 'vivo投诉客服电话多少', 'vivo拆机视频', 'vivo智能手机体验店(京口路)怎么样', 'vivo百分百全面屏', 'vivo的隐藏功能怎么去掉', 'vivo耳机有杂音', 'vivo蓝牙开放性监测', 'vivo设置电池在哪', 'vivo账户是否能找回被盗手机', 'wey vv5车轮', 'www.苹果定位', 'x40奔腾平均油耗怎么看', 'x9手机壳vivo', 'xy苹果助手为什么导入铃声失败', 'y75s 荣耀9青春', 'yamaha 小号', 'yamaha+Q2031A+报价', '“阳光车”有哪些?', '【二手2016款中华H530报价及图片】-赶集网', '【易车原创】长安神骐T20加长版内饰曝光', '【英朗停车打不着火】_58车', '一个普通人多少岁能买到兰博基尼', '一加5t通话录音在哪', '一加6怎么换闹铃铃声', '一加手机 T系列', '一加手机 通话录音', '一加手机拍照聚焦', '一加手机格式化也无法开机', '一残钓带三星', '一汽丰田14t', '一汽国产', '一汽奔腾森雅r7价格', '一汽马自达6新款2018', '一般苹果刷机要多少钱', '一零年荣威550车身自重', '七速双离合和无级变速哪个成本高', '三代飞度变速箱', '三国杀移动版手机解绑', '三星 c27f390', '三星 tab and t231', '三星 ua55ju7800jxxz', '三星 双模机 好用么', '三星0220', '三星3201加粉视频', '三星5577', '三星65MU8900', '三星8x', '三星931bw屏坏', '三星AK50y', '三星N2071可以快速扫描吗', '三星a5没声音了', '三星a8电池好配吗', '三星bixby键失灵', '三星cn860evo怎么安装', '三星i777 官方rom', '三星note2充不满电', '三星note3扬声器破音', '三星note能不能上内存卡', '三星n系列买单不买双?', '三星oled屏等级', '三星s3手机连电脑', '三星s5联通卡插卡1还是卡2?', '三星s5触摸屏上半能用下半屏不能用怎么维修', '三星s6充电响一声怎么就不充了', '三星s6导管散热', '三星s9弹出支付宝', '三星shpdp728密码忘了', '三星sv843', '三星ua40kuf30e拖影', '三星vpl800dv', '三星交通卡充值', '三星使用记录代码', '三星冰箱电脑板', '三星危险截图', '三星取消私密模式', '三星和京东方', '三星官网手机', '三星微单nx镜头系列', '三星手机 充电慢', '三星手机不能记步数', '三星手机吧 贴吧', '三星手机录制屏幕设置权限', '三星手机怎么发不出去短信', '三星手机怎么放电影好黑怎么回事', '三星手机报价表', '三星手机最新刷机包', '三星手机红外线', '三星手机进水后一直停在sanxing界面', '三星换内外屏多少钱', '三星换屏幕把主板弄坏了', '三星数字音频输出', '三星显示器各型号定位', '三星液晶电视内存多大的', '三星电芯钢码', '三星电视为啥上不了网', '三星移动硬盘价格', '三星老手机手机怎么刷机', '三星贴片托盘型号表', '三星限制服务什么意思', '三星霹雳道', '三百元以下5 5寸智能手机', '三菱M8037', '三菱plcincp', '三菱停产车型图片', '三菱劲炫起动机无反应', '三菱戈蓝空调滤芯怎么拆', '三菱机油格那些车在用', '三菱翼神轮毂尺寸', '上档次的suv', '上汽大众suv7座', '上汽大通油耗多少', '上汽荣威 P0132', '苏宁抢到的诺基亚x6几天到货', '英朗2018款是几厢车', '英朗刮雨器加水位置', '英版爱他美白金版商店为什么不卖了', '英菲尼迪4s店南京地址查询', '英菲尼迪q50轮胎气压复位', '英菲尼迪是哪个系列的车', '苹果 1.6ghz 2.2ghz', '苹果 字体 写错', '苹果1807期货分', '苹果4s8系统能不能微信', '苹果4s怎么停用了', '苹果4上微信', '苹果4什时候上市', '苹果4手机多少钱一台', '苹果4西瓜视频', '苹果A1810', '苹果X微信很卡', '苹果a6处理器', '苹果ad为何退不出来', '苹果app密码忘记了', '苹果iDiad经销商', '苹果id换手机电话号码怎么恢复', '苹果id最多用几台设备', '苹果lius', '苹果pay nfc用不了', '苹果plus8有几个颜色', '苹果shuffle充不上电', '苹果s手机', '苹果wi-fi信号差怎么回事', '苹果x下个版本', '苹果x关机还能定位吗', '苹果x如何隐藏短信和微信', '苹果x实况照片剪裁', '苹果x强制开机怎么开', '苹果x手机储存空间满了怎么办', '苹果x打电话总是突然没声音', '苹果x有没有红外线功能', '苹果x没有设备管理吗', '苹果x的后壳外套', '苹果x的电池健康', '苹果x第三方无线充电包', '苹果x面容怎么不行', '苹果x高清素材', '苹果一代手表一直啟動', '苹果七怎样关燥音', '苹果上锁定音是什么', '苹果不升级充电受限吗?', '苹果专属铃声是哪个', '苹果丢失手机锁机如何解锁', '苹果个性锁屏壁纸图片', '苹果九现在卖多少钱', '苹果亮度低时阴阳屏', '苹果什么手机是A9', '苹果充电30秒就没有充电标示了', '苹果充电器有识别码吗', '苹果充电宝什么品牌好', '苹果充电线时好时坏', '苹果公司职务级别', '苹果六扩大内存', '苹果六西格玛', '苹果刘萍年龄', '苹果十有多少g的', '苹果原装充电器都有赛尔康字吗', '苹果合约以往10月报价', '苹果后壳碎了', '苹果售后协助激活', '苹果四忘记密码了怎么办', '苹果地图褐色线是什么', '苹果如何添加来电铃声', '苹果屏幕修要多少钱', '苹果序列号无法查询会影响什么', '苹果微信铃声没有声音', '苹果怎么关闭相机拍照声音', '苹果怎么找回昨天的通话记录', '苹果怎么把三全音更换', '苹果怎么指纹直接解锁', '苹果怎么设置亮屏时间', '苹果手机 说运动开始', '苹果手机,短信发完是蓝色', '苹果手机9X', '苹果手机id', '苹果手机siri视频都听不到声音', '苹果手机一开机就死机怎么回事', '苹果手机不用手机壳', '苹果手机价格图片', '苹果手机充电器裂开', '苹果手机关机闹铃', '苹果手机勿扰模式闹钟会响吗', '苹果手机可以挂失', '苹果手机可以用安卓手环吗', '苹果手机听筒越来越轻打电话', '苹果手机哪种最实用', '苹果手机售后维修点宁海', '苹果手机在锁屏状态下怎么挂断电话', '苹果手机型号与年代', '苹果手机如何关掉照相声音', '苹果手机如何添加自定义铃声', '苹果手机定位 美国人', '苹果手机寻回', '苹果手机屏幕自动旋转', '苹果手机屏幕黑屏是怎么回事', '苹果手机开机无法充电', '苹果手机得光圈咋莱啊', '苹果手机怎么充快币', '苹果手机怎么在itunes上传铃声', '苹果手机怎么在抖音下载铃声', '苹果手机怎么解开ID', '苹果手机怎么转移到国产新通讯录', '苹果手机手机带耳机看视频有声音', '苹果手机拍照怎么是歪的', '苹果手机拍照闪不了光怎么办', '苹果手机按键掉了怎么办', '苹果手机换号码转移之前联系人', '苹果手机换壳怎样看', '苹果手机插了耳机以后听筒很轻', '苹果手机摔下之后开不了机', '苹果手机摔了之后摄像头晃', '苹果手机更换非原装电池', '苹果手机有哪些企业名称', '苹果手机有时候通话有杂音,重启后恢复', '苹果手机来电怎么关灯', '苹果手机桌面短信怎样才不让人看见', '苹果手机爱思助手', '苹果手机电池为什么显示黄色', '苹果手机的充电器充不到电', '苹果手机短信如何转移到另一部苹果手机', '苹果手机系统更新了会怎么样', '苹果手机联通卡无服务怎么回事', '苹果手机苹果耳机怎么切换音乐', '苹果手机蓝牙怎么连接电脑', '苹果手机虎二不仅仅是喜欢铃声', '苹果手机装上屏幕总成开机显示横竖直线花纹是什么原因', '苹果手机解锁刷机后还能用吗', '苹果手机跟opop哪个像素好', '苹果手机软件怎么改名', '苹果手机通知和铃声音量怎么分开设置', '苹果手机通话中断', '苹果手机通话屏幕不灭', '苹果手机那款是没有还回键', '苹果手机间怎么移短信', '苹果手机黑夜拍照', '苹果手机黑屏打不开过会又自己开机过会又黑屏了', '苹果手表可以在线购买ac 吗', '苹果打电话说话对面听不到', '苹果换了电池算维修吗', '苹果支付宝运动与健身开启', '苹果支持4k吗', '苹果无删减版本', '苹果更换电池要多久', '苹果本地铃声在哪', '苹果桌面找不到短信', '苹果激活越过读卡', '苹果烫', '苹果电信卡蜂窝用不了', '苹果电脑如何制作苹果手机铃声', '苹果电脑系统更新要多久时间', '苹果的mp3', '苹果的稍后提醒时间', '苹果的语音唤醒原理', '苹果短信全选', '苹果短信没声音', '苹果系统与miui9谁流畅', '苹果翻墙网站大全', '苹果耳机用在电脑上怎么和手机上声音不一样', '苹果耳机线压扁', '苹果联想设计图片', '苹果自动关机后充电不开机', '苹果自带相机拍不了', '苹果蓝牙耳机有售后吗', '苹果解ID第一次没有成功下次会不会有影响', '苹果质保期内可以置换新机吗', '苹果返回排线是连在按键上的吗', '苹果通讯黑名单在哪里', '苹果铃声只能40', '苹果铃声怎么换', '苹果音乐基站使用方法', '苹果黑屏烫', '荒野行动法拉利跑车悦换码', '荣威350专用行车记录仪app', '荣威350机油用量', '荣威4s店嘉实多5w/30是全合成', '荣威550机油尺怎么看到那里正好', '荣威950更换变速箱油', '荣威Rx8汽车用品', '荣威erx5强混', '荣威rx3车多少钱', '荣威rx5 免息贷款', '荣威rx5百公里油耗', '荣威rx5老亮三个故障灯', '荣威国产还是合资车', '荣耀 后盖', '荣耀 杂志锁屏能不能删除', '荣耀102维码', '荣耀10专业测评', '荣耀10为啥屏幕自己黑', '荣耀10什么颜色', '荣耀10如何查自己手机用的什么屏一', '荣耀10拍照怎样虚化', '荣耀10指纹键如何使用说明书', '荣耀10耳机推荐', '荣耀10配色', '荣耀6X摇一摇没反应', '荣耀6的数据线', '荣耀7c手机锁屏后收不到微信', '荣耀7c畅玩7c', '荣耀8 充5v4a', '荣耀8p手机卡槽', '荣耀8是多少寸的', '荣耀8青春版 解锁后 提示 无法刷入recovery', '荣耀9小猪手机壳', '荣耀9面部解锁', '荣耀V 10和荣耀10', '荣耀chinamobile手机可以放电信卡吗', '荣耀v10屏幕智能分辨率', '荣耀v10新机注意', '荣耀v9快充协议是pd还是qc', '荣耀v9手机壳弯曲怎么办', '荣耀v9的otg在哪', '荣耀zero白色换什么表带', '荣耀八铃音', '荣耀加冕意思', '荣耀小7', '荣耀手机总是自己下载东西', '荣耀手机看不了ppt', '荣耀王者前50还是前100', '荣耀畅玩7x怎么指关节截图', '荣耀畅玩7x玩刺激战场', '菠萝大众汽车所有车型', '菲亚特菲翔2015款大灯总成', '菲翔钥匙换电池', '蒙迪欧 机油 高温', '蒙迪欧连蓝牙播放音乐没有声音怎么弄', '蓝魔手机怎么刷机', '蔚来车主服', '西海明珠大厦苹果售后', '观致3空气滤芯怎么更换视频', '解放微卡车辆识别号', '触摸互动大屏幕', '试驾2018版吉利远景suv视频', '请问一下东风日产轩逸轿车风挡玻璃是多大规格的', '请问同学们,奔驰和长安奔奔有差别吗', '诺基亚5700刷机', '诺基亚7模式', '诺基亚c2-06', '诺基亚x6什么时候能抢到', '诺基亚为什么倒闭', '诺基亚小手机密码', '诺基亚怎么退出免打扰', '豪华奔驰房车报价的原因', '贝尔丰手机图片', '货车jiay', '货车前轮发抖摆动', '货车加钢板了好不好', '货车帮服务热线', '货车底盘拉杆', '货车拉花苗上高速需要交费吗?', '货车提档收费用吗', '货车最好的桥是什么桥', '货车质保期', '货车超车在快车道被拍', '货车车顶行李架图', '货车钢圈变形能修复吗', '货车高速别车', '贵阳马自达维修', '赛欧p0720输出速度传感器是什么问题', '赛非尔非有皇冠', '赣州福田二手自卸车', '起亚4s店起亚k2报价', '起亚K3近光灯灯泡怎么换', '起亚k2 b2500故障码', '起亚k2行车显示详解', '起亚k3怎么开蓝牙', '起亚k3遥控器拆装', '起亚k4图片 m.baidu.com', '起亚k5能改电子手刹吗', '起亚嘉华2.2柴油评测', '起亚新k3豪华款', '起亚狮跑改气后怎么', '超值的奔驰房车价格大全', '跃进四米二的货车', '跑车哪家好', '跑车配件', '路帝h文', '路虎加多少号油', '路虎发现神行百公里加速', '路虎和退伍军人姿势', '路虎揽胜行政版七座', '路虎揽胜运动版哪个好点', '路虎极光4.0', '路虎的产地是哪个国家', '路虎车型一样的什么车', '车子累积里程怎么算', '轩逸1.6XL 1.6XV+区别', '轩逸2018尊享版有机械钥匙吗', '轩逸一键启动,按一下', '轩逸多长时间更换防冻液', '轩逸经典米色内饰改装', '转子引擎马自达', '轻骑铃木qs5f油箱红色', '辉腾3.2怠速1500转怎么解决', '辽宁城市排名2018', '迈巴赫s600价格表', '迈腾17款钥匙打火', '迈腾2018尊贵型价格', '迈腾7档', '迈腾8寸玻璃屏', '迈腾仪表盘中控怎么设置', '迈腾储物箱等', '迈腾凯撒金好看还是开罗金好看', '迈腾和奥迪a4l空间哪个好', '迈腾挂自行车', '迈腾空调泵异响', '迈腾胎压检测按钮在哪', '迈腾钥匙壳价格', '迈锐宝xl rs', '迈锐宝xl换档', '迈锐宝一踩油门感觉中打一顿', '进口大众gtr', '进口捷豹', '进口高尔夫旅行版价格', '远景x3吉利汽车', '迷你和甲壳虫哪个好', '逍客 5W35', '逍客的超速箱油有能不能换', '途乐几年一检测', '途安l后排空间尺寸', '途昂有必要买四驱吗', '途昂车钥匙有没有皮套', '途观1.4t加多少号汽油', '途观l后备箱遮物帘', '途观l怎样在中控设置关窗', '途观仪表维修', '途观左后轮刹车位置有声响', '途观的按键功能图片介绍', '途锐 空调 风小', '通用凯迪拉克官网', '速派和思域买哪个好', '速腾1.4t省的吗', '速腾80机油灯亮', '速腾中控能放视频吗?', '速腾的雨刷器在哪', '速腾颜色高清图片大全', '道奇caivan是啥车', '遥控车奥迪', '郑州二手沃尔沃S60L', '酷比手机丢了怎么样才能找回', '酷派是1', '酸奶盒和苹果', '醉阳光', '重庆路虎4s店地址全部', '金刚网纱窗名片图片', '金华永康3万元以下二手车交易市场', '金奥迪', '金杯小货车双排座', '金杯海狮行驶中偶尔加油门无反应', '金杯阁瑞斯尾门玻璃价格', '金牛座机车', '金立F6是OGT吗', '金立M5手机的卡插起显示不出', '金立S5.5手机怎么拆', '金立f6怎么root', '金立m6喇叭有几个', '金立m6怎么强制性开机关机', '金立m7l电池容量多大', '金立s9L是定制机吗', '金立手机发烫什么原因?', '金立手机屏幕变成色了', '金立手机手机壳', '金立手机黑屏幕怎么办', '金立超薄智能手机报价', '金色莲花寓意', '钻石小鸟名为花冠的戒指', '铁西区万象汇小米手机专卖店电话', '铃木吉姆尼发动机配置', '铃木尼母尼', '铃木新奥拓2018', '银色牧马人撒哈拉视频', '锋范安装玻璃升降器', '锐志加92的注意了', '锐志和迈腾油耗', '锐志空调没开怎么有风出来', '锐界2.0T底盘', '锐界车灯延迟', '锐界近光灯换氙气', '锤子坚果3配置', '长城C30发动机总成报价', '长城c30空调冷凝器', '长城vv5汽车钥匙', '长城vv6预售价12万吗', '长城vv7和vv7s哪个大', '长城干白葡萄酒多少钱', '长城干红葡萄酒多少钱', '长城汽车的建议', '长城精灵电动车', '长城自动挡汽车', '长城魏vv5价格', '长安20万左右的车', '长安75中控造型设计变形金刚', '长安CS55图片报价', '长安CX20防冻液管子', '长安M70和新海狮Ⅹ30L', '长安cs55和奔腾x40', '长安eodaxt ask.m.yiche.com', '长安上角信丰厂', '长安之星2更换扬声器', '长安之星2顶棚怎么拆', '长安之星点火顺序图', '长安凌轩的小毛病多吗?', '长安双排双胎三米六车厢二手车齐齐哈尔哪里卖', '长安商用欧诺后车门怎么打不开', '长安奔奔迷你前挡风自己动手贴膜', '长安小SUV', '长安形成', '长安悦翔86', '长安悦翔v7后备箱', '长安星卡双排驾驶室改装', '长安欧尚亲情服务app', '长安欧尚前保险杠贴纸', '长安汽车cx70t自动挡', '长安汽车是什么发动机', '长安混合动力汽车报价', '长安福特双离合公告', '长安离万江有多远', '长安蓝鲸发动机参数造假', '长安跨越王x3双排双轮仓栅', '长安车和吉利车哪个好', '长安车多少钱', '长安车挡雨器', '长安逸动 燃油宝', '长安逸动o近光灯不亮', '长安逸动车内噪音是多少分贝', '长安马自达2020项目', '长安马自达马三宝安肛怎么归零', '长春捷达拆车件门把手', '长虹55d2p外观', '长虹s06手机多少钱', '长陈哈弗h6左前大灯总成多少钱', '阜新兴顺吉利', '阳光车导司机赚钱吗', '阿特兹 ad.doubleclick.net', '阿特兹改gps', '阿瓦提雪铁龙车灯升级', '附近没有苹果维修点', '陆风逍遥怎么样', '陕西雪佛兰4s店地址', '雄狮庄园副牌2011', '雅阁10代 黑', '雅阁2.4节气门电路图', '雅阁2018和思域', '雅阁八代空调不凉', '雅阁大灯多少钱', '雅阁斌派和山岳', '雨燕,', '雪佛兰AALS', '雪佛兰乐风10年八万公里多少钱', '雪佛兰乐驰 英语', '雪佛兰是那国车', '雪佛兰科鲁兹右前abs传感器回路', '雪佛兰车标是什么样的', '雪佛兰迈锐宝后视镜折叠按钮?', '雪弗兰探界者能从邮箱抽油吗', '雪弗兰科鲁兹2018款是几缸啊', '雪铁龙c3-xr评论', '雪铁龙c4L蒸发箱怎么找', '雪铁龙c5大灯功略', '雪铁龙世嘉可以装led灯吗?', '雪铁龙凯旋换机油作业', '雪铁龙哪款车高端', '雷丁D30参数配置', '雷丁电动皮卡', '雷克萨斯350报价及图片', '雷克萨斯cs200二箱', '雷克萨斯nx系列是否是愤怒', '雷克萨斯ux250', '雷克萨斯ux和nx', '雷克萨斯最低配', '雷克萨斯锐志', '雷凌双擎 行车看视频', '雷凌车与车相撞的图片', '雷诺发动机气门下沉量', '雾天行驶开什么灯图解 捷达', '青岛中兴华会计师事务所', '领克02真实油耗', '领克08车身尺寸', '颐达中控怎么用', '风光580五座图片', '飞利浦(PHILIPS SHB4205与荣耀xSport AM61', '飞度加机油加几升', '飞度加装涡轮增压', '飞度机油滤', '飞度档位有灯吗', '飞驰的说说', '马自达 h02s12', '马自达2.5t真假', '马自达323座驾拆下来安装到飞度车合适不', '马自达3空调能换个制冷好的吗', '马自达4s换避震多少钱', '马自达6 如何打开发动机盖', '马自达6发动机号在哪里', '马自达cx-5机油增多', '马自达cx9油耗', '马自达suv汽车报价', '马自达xc9', '马自达昂克赛拉出现叹号', '马自达阿特兹17款', '马萨拉蒂170万', '马里奥奥德赛月之国更后面', '驭胜s330为什么卖不动', '驭胜s350灯泡型号', '骊威后出风口改造', '骏派d60钥匙拆机', '骐达打车有异响', '高尔夫1.4t旅行', '高尔夫6更换 门锁开关', '高尔夫7水泵多少钱', '高尔夫和Polo区别', '高尔夫嘉旅可以换个亮点的灯泡吗', '高尔夫的离合器和迈腾双离合器是一样', '高尔夫轮胎气压复位', '高栏7米2江淮180马力的能装210马力马雨菜的', '高通450pk华为659', '高通8001002高通800 - 百度', '高通骁龙65243', '魅族 屏幕 价格', '魅族2g转3g', '魅族m15和15plus', '魅族model bt50', '魅族mx4刷什么牌子系统好', '魅族mx5怎么插入内存卡', '魅族pto7', '魅族关闭耳机返听后唱歌无法录音', '魅族备份后在哪找到', '魅族手机可以远程开机么', '魅族手机怎么不在指定位置钉钉打卡', '魅族手机怎么恢复外音', '魅族手机找回flyme密码', '魅族手机远程拍照吗', '魅族立体耳机', '魅族系统flyme6下载', '魅族运营商显示cncc', '魅族黑科技', '魅蓝metel双卡双待吗', '魔音耳机 htc', '黄海皮卡。2.4T', '黑色polo长衫搭配', '黑色迈腾改装', '黑莓priv怎么双清', '黑鲨手机测评视频小白', '*#06#华为怎么查屏幕险', '02polo空调滤芯在哪里', '02年蓝鸟老是灭车', '02款奥迪a6的远光灯什么型号', '03帕萨特b52.8配置', '04丰田老花冠仪表图解', '05年天籁230车内按键图解', '06年中华骏捷保险盒图', '06年别克君越图片', '06款思域怎么样', '07年海马福美来', '07款奥迪a6l空调说明', '08年卡罗拉换一个镜多少钱', '08款海马报价及图片', '08款索纳塔1.8l', '09款牧马人', '1.5亿劳斯莱斯', '1.6的法拉利', '10.78万读作', '100座宇通豪华大巴图片', '1040是小米充电宝能冲手机充几次?', '10万啊', '10万的大众车子哪款好', '10图国四10年三菱V3顶', '10年的高尔夫6还有多少钱', '10款锐志改装13款导航', '11款致胜2.0t时尚版防冻液需要几升', '11款途安远光灯', '12代皇冠顶配怎样开脚托', '12年瑞风多少钱', '12年进口途观', '13万左右轿跑', '13年日产NV200多少钱', '13款嘉年华空调滤怎么换', '13款宝马x5改装案例', '13款迈锐宝空调面板背景灯不亮', '14年比亚迪速锐二手车现在值多少钱?', '14年迈腾车钥匙', '15万auv车', '15年大众朗逸二手车价格', '15款奥德赛舒适型没有导航', '15款长安逸动配置', '15款雅阁二手车价格', '16款丰田普拉多保险丝', '16款进口X3有没有四驱', '16逍客自动挡内掉入两个小卡片,有影响吗', '17卡罗拉 自带导航', '17卡罗拉在车里后备箱开关在哪', '17款博瑞新博瑞', '17款捷达前轮近孔里了方向能变不', '17款科鲁兹旋风', '17福克斯改大灯', '18款保时捷panamera哪种效果好', '18款兰德酷路泽的质量', '18款奔驰GLS63哪个好用', '18款宝马X7售后服务怎样', '18款比亚迪f3试驾', '18款索纳塔9测评', '18款轩逸经典领先版怎么样', '18款锐界和17款区别', '18款高尔夫1.2T加倒车影像', '2.5D传奇', '2000元什么手机好', '2000左右小屏手机', '2005凯越换机油要几升', '2007款丰田锐志', '2010年凯越值多少钱', '2010款英朗1.8凸轮轴排排气电磁阀和进气电磁阀可一样', '2010款锐志车身尺寸', '2011年的克莱斯勒咋样换电瓶', '2011款飞度是几寸轮铃', '2012款奇骏怎么样', '2012款索纳塔8功率', '2012江淮格尔发重卡发动机', '2012起亚狮跑520', '2013 yeti asr 5', '2013款2.0t迈腾油耗', '2013法拉利嘉年华', '2013马自达6轮胎型号', '2014款别克25s是国五吗', '2015款标致508配置', '2015款途观发动机Ea888第三代', '2015神行者SALFA2BG', '2016十一万仙山能进吗', '2016年奥迪q5二手价格及图片', '2016款桑塔纳试驾视频', '2016福睿斯配置情况', '2017卡罗拉座椅高低怎样调节', '2017年上汽集团现金流量表', '2017年铃木汽车故障投诉', '2017指南者臻享版', '2017朗逸改装效果图', '2017款名图买了后不后悔', '2017款现代汽车', '2017途观销量', '2018glecoupe报价', '2018买哪款suv', '2018北京现代汽车退出中国', '2018城市戏剧节', '2018年5月上汽大众汽车销量', '2018年吉利新帝豪llhs汽车碰撞测试结果', '2018年苹果手机什么时候出来', '2018年长安员工购车优惠', '2018本田凌派会出新款吗', '2018款2.5t的新款凯美瑞后排坐凳拳能放倒吗', '2018款20t昂科威内饰', '2018款大众途观l中控', '2018款奔驰gls63价格', '2018款宝马x3预测报价', '2018款汉兰达尊贵轮胎品牌', '2018款速腾pq35平台', '2018苹果商店退款流程', '2018黑户借到30万', '24°济南33°/24°领京东卡啦百度一下付5万定金定吉利博瑞GE,车主试驾一圈,坦', '25万办什么样的车', '2手柴油货车出手', '3.3米的货车有哪些', '30万供10年', '325T 雪佛兰价格', '360助手怎么强制解锁', '360官方报价', '360手机卫士厂', '360是不是国产机', '360超级root+总是终止', '4.2米货车年审多少钱', '4376轴承丰田', '49寸索尼7000d', '4万00期', '4米2厢货车', '5.9米吉利加长礼宾车', '5008七座', '500万万元', '570雷克萨斯尺寸', '5s充电一直红色不进电', '5座与7座的区别', '6.8米箱式货车拉什么货', '64寸三星液晶电视价格', '6s怎么加防水贴', '70万以下的suv', '7plus苹果手机什么时候上市的', '7月1日关税下调路虎揽胜', '7月1日关税降价后买100万的进口车能降多少钱', '8848手机和苹果哪个好']
# badcase_lst = []
# wrong_lst = []
# lost_lst = []
# for lines in lost:
#     aaa = lines.split('|')
#     bbb = aaa[1].split('\t')
#
#     if bbb[0] in same:
#         badcase_lst.append(bbb[0])
#
# print(badcase_lst)
# print(len(badcase_lst))

# STEP 3
# badcase_lst = ['铃木650sv', '铃木re5二手', '铃木口琴c20优缺点', '铃木天语sx4汽车配件', '铃木英祖玛400', '长城原创', '长城特制解百纳', '长城高级解百纳干红750ml', '长安灵沼要归高新了吗', '长虹32e8怎么样', '长虹3d46c2000i换内屏多钱', '长虹50f9电视日期', '长虹电视43寸4k多少钱', '阳光保险车意纪念基础版五座保费什么意思', '陆风程亦辰第一次肉', '随机联想法', '雄狮红盒', '非常苹果饮料 童年', '飞利浦she3205耳机好吗', '香港地区奥迪轻微追尾事故图片', '马自达泵头批发', '马里奥奥德赛倒金字塔', '魅族ep21耳机 接线', '魅族做吧', '魅族耳机EP21如何', '魔声耳机和苹果耳机', '黑色手机卡', '长城瑰密', '龙泉驿区三星冰箱售后维修服务', '100万贷款分10年还', '2000年有20万', '2016年北京购房新政', '2017北京女排名单', '2018北京博览会', '24 105索尼', 'Samsung/三星55MU6320', 'b593s-850华为', 'envy13金色', 'e人e本的手写笔有什么用', 'gta脸', 'google服务4.4', 'jeep服装玉林玉州区专卖店', 'jeep的夹克', 'lg gram 和xps15', 'lg照片打印机型号对比', 'moji辞书在苹果上需要花钱', 'tcl55寸液晶电视屏幕旁有绿色线', 'v.qq.com/x/cover/suvdws3azg0yhxg/i0639sc6pcp.html', 'yamaha 小号', 'yamaha+Q2031A+报价', '一残钓带三星', '三星 c27f390', '三星 tab and t231', '三星 ua55ju7800jxxz', '三星3201加粉视频', '三星65MU8900', '三星8x', '三星931bw屏坏', '三星N2071可以快速扫描吗', '三星cn860evo怎么安装', '三星shpdp728密码忘了', '三星sv843', '三星ua40kuf30e拖影', '三星vpl800dv', '三星冰箱电脑板', '三星危险截图', '三星微单nx镜头系列', '三星显示器各型号定位', '三星液晶电视内存多大的', '三星电芯钢码', '三星电视为啥上不了网', '三星移动硬盘价格', '三星贴片托盘型号表', '三星霹雳道', '三菱M8037', '三菱plcincp', '三菱劲炫起动机无反应', '三菱机油格那些车在用', '英版爱他美白金版商店为什么不卖了', '苹果1807期货分', '苹果刘萍年龄', '苹果无删减版本', '苹果的mp3', '荒野行动法拉利跑车悦换码', '荣耀王者前50还是前100', '触摸互动大屏幕', '货车帮服务热线', '货车超车在快车道被拍', '货车最好的桥是什么桥', '货车高速别车', '轻骑铃木qs5f油箱红色', '遥控车奥迪', '酸奶盒和苹果', '金色莲花寓意', '长城干白葡萄酒多少钱', '长城干红葡萄酒多少钱', '长安离万江有多远', '长虹55d2p外观', '青岛中兴华会计师事务所', '飞利浦(PHILIPS SHB4205与荣耀xSport AM61', '10.78万读作', '10万啊', '2.5D传奇', '2016十一万仙山能进吗', '2018黑户借到30万', '30万供10年', '49寸索尼7000d', '4万00期', '64寸三星液晶电视价格', '7plus苹果手机什么时候上市的', '2017斗鱼嘉年华时间', 'Americapic', 'The matrix', 'blue yeti 多少钱', 'dnf 帕拉丁 荒古太刀', 'dnf帕拉丁异界套3选择', 'hybrid hhd', 'mini软件', 'polo钱包', 'ps4高尔夫', '辽宁城市排名2018', '醉阳光', '金刚网纱窗名片图片', '钻石小鸟名为花冠的戒指', '阳光车导司机赚钱吗', '飞驰的说说', '马里奥奥德赛月之国更后面', '黑色polo长衫搭配', '2013 yeti asr 5', '500万万元']
# wrong_lst = ['8848 风尚版和巅峰版区别', 'OPPOfindx和1加6', 'h6coupe 天窗怎么洗', '锤子坚果3防水吗', '锤子坚果pro2续航怎么样', 'q3 途观', 'y75s 荣耀9青春', '锤子坚果3配置', '魅族m15和15plus']
# lost_lst = ['长城p8的电池是自己的吗', '长城vv7s首付价格', '长安cx7016标准型怎么样', '长安sl5', '长安新豹保修多久', '长安星豹单排小货车铭牌在哪', '雪佛兰探界音响配置', '雪佛兰科罗拉多皮卡', '马自达 mps 无敌汽车网', '马自达aexla3', '马自达昂克赛拉有中置拉叭', '马自达昂克赛拉格调灰', '魅族3手机介绍', '魅族m3 note截屏在那', '魅族note5用哪个导航', '黄海h5', '04年日产天懒值多少钱', '06年别克凯悦怎么样', '08年宝马320i动力可以吗', '12年东风嘉龙4米5自卸车六缸180马力', '17年福特翼博右镜总成4s店換几钱', '17款丰田FJ酷路泽在哪里好', '2015款三菱劲炫怎么样', '2018小米六还值得买吗', '2018款大众途行', '2018路虎皇家一号', '5x为啥没有国际版miui', '740li宝马解介', '7座东风小康多少钱', 'OPPO v57', 'ZenFone 3 Deluxe尊爵版', 'clvlc东风本田220图片', 'htc eris', 'htcL22信号差', 'mg名爵gs', 'oppo x1开机', 'p20 谷歌', 's7500三星手机报价', 'tcl n3', 'tcls900怎么强制恢复原厂', 'vivo21拍照按键', 'x9手机壳vivo', '三星a5没声音了', '三星a8电池好配吗', '三星note2充不满电', '三星note3扬声器破音', '三星s3手机连电脑', '三星s5联通卡插卡1还是卡2?', '三星s5触摸屏上半能用下半屏不能用怎么维修', '三星s6充电响一声怎么就不充了', '三星s6导管散热', '三星s9弹出支付宝', '苹果4s8系统能不能微信', '苹果4s怎么停用了', '苹果4上微信', '苹果4什时候上市', '苹果4手机多少钱一台', '苹果4西瓜视频', '苹果X微信很卡', '苹果a6处理器', '苹果plus8有几个颜色', '苹果x下个版本', '苹果x关机还能定位吗', '苹果x如何隐藏短信和微信', '苹果x实况照片剪裁', '苹果x强制开机怎么开', '苹果x手机储存空间满了怎么办', '苹果x打电话总是突然没声音', '苹果x有没有红外线功能', '苹果x没有设备管理吗', '苹果x的后壳外套', '苹果x的电池健康', '苹果x第三方无线充电包', '苹果x面容怎么不行', '苹果x高清素材', '苹果七怎样关燥音', '苹果六扩大内存', '苹果六西格玛', '苹果十有多少g的', '苹果四忘记密码了怎么办', '荣威erx5强混', '荣耀102维码', '荣耀zero白色换什么表带', '起亚新k3豪华款', '金立m7l电池容量多大', '金立s9L是定制机吗', '铃木尼母尼', '铃木新奥拓2018', '长城vv5汽车钥匙', '长城vv6预售价12万吗', '长城vv7和vv7s哪个大', '长城魏vv5价格', '长安M70和新海狮Ⅹ30L', '长安75中控造型设计变形金刚', '长安汽车cx70t自动挡', '雷克萨斯350报价及图片', '雷丁D30参数配置', '雷克萨斯cs200二箱', '领克08车身尺寸', '风光580五座图片', '魅蓝metel双卡双待吗', '16款进口X3有没有四驱', '570雷克萨斯尺寸']
#
# new_kg = open('/Users/Kevin/Downloads/1824_result.txt')
# new_bc = open('/Users/Kevin/Downloads/1824_result_badcase.txt', 'w')
# count_bc = 0
# new_wrong = open('/Users/Kevin/Downloads/1824_result_wrong.txt', 'w')
# count_wrong = 0
# new_lost = open('/Users/Kevin/Downloads/1824_result_lost.txt', 'w')
# count_lost = 0
# count_good = 0
# count_lines = 0
#
# for lines in new_kg:
#     count_lines += 1
#     aaa = lines.split('\t')
#     if aaa[0] in badcase_lst:
#         new_bc.writelines(lines)
#         count_bc += 1
#     if aaa[0] in wrong_lst:
#         new_wrong.writelines(lines)
#         count_wrong += 1
#     if aaa[0] in lost_lst:
#         new_lost.writelines(lines)
#         count_lost += 1
#     else:
#         count_good += 1
#
# print(count_bc, count_wrong, count_lost, count_good, count_lost+count_good+count_wrong+count_bc)

# STEP 4
# dif = open('/Users/Kevin/Downloads/dif.txt')
# new_dif = open('/Users/Kevin/Downloads/new_dif.txt', 'w')
# count = 0
# count_work = 0
# a = 0
# for lines in dif:
#     a += 1
#     aaa =lines.split('\t')
#     try:
#         b = aaa[1]
#     except IndexError:
#         print(lines.strip())
#         count += 1
#     else:
#         new_dif.writelines(lines)
#         count_work += 1
#
# print(count,count_work,a)

# STEP 5
# new_dif = open('/Users/Kevin/Downloads/new_dif.txt')
# nov = open('/Users/Kevin/Downloads/nov.txt', 'w')
# yesv = open('/Users/Kevin/Downloads/yesv.txt', 'w')
#
# count_not = 0
# count_yes = 0
#
# for lines in new_dif:
#     lines = lines.strip()
#     aaa = lines.split('\t')
#     if 'version' not in aaa[1] and 'series' not in aaa[1]:
#         nov.writelines(lines+'\n')
#         count_not += 1
#     else:
#         yesv.writelines(lines+'\n')
#         count_yes += 1
#
# print(count_not,count_yes,count_not+count_yes)

# STEP 6
# bc = open('/Users/Kevin/Downloads/badcase.txt')
# lt = open('/Users/Kevin/Downloads/lost.txt')
# wg = open('/Users/Kevin/Downloads/wrong.txt')
#
# a = 0
# for lines in wg:
#     a += 1
# print(a)